app/controllers/v1/events_controller.rb

INSERT INTO "events" ("created_at", "updated_at", "name", "description", "address") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", "2018-06-03 19:23:02.465684"], ["updated_at", "2018-06-03 19:23:02.465684"], ["name", "Baskbetball Tournament"], ["description", "Ball the F up!"], ["address", "1259 Meinel rd"]]
---
  def create
    @event = current_user.events.create(event_params)

SELECT "events".* FROM "events" WHERE (events.lat IS NOT NULL AND events.lng IS NOT NULL) AND (events.lat>1.9277150735732047 AND events.lat<2.0722849264267955 AND events.lng>0.9276710127552064 AND events.lng<1.0723289872447939) AND ((
---
  def set_event_by_id
    @event = Event.find_by_id(params[:id] || params[:event_id])